// 1. Вивести в консоль всі числа від 1 до 10 за допомогою циклу while.
let i = 1
while (i <= 10) {
    console.log(i);
    i += 1
}

// 2.Вивести в консоль всі парні числа від 2 до 20 за допомогою циклу for. Якщо число парне, пропустити його за допомогою continue.

for (let i = 2; i <= 20; i += 1) {
    if (i % 2 !== 0){
        continue
    }
    console.log(i);
}

// 3. Вивести в консоль таблицю множення числа 7 за допомогою циклу for.

const seven = 7;
for (let i = 1; i <= 10; i += 1) {
    console.log(`${seven} * ${i} = ${seven * i}`);
}

// 4. Створити скрипт, який виводить в консоль всі числа , які менші за n. Якщо зустрічається число, що більше або дорівнює n, цикл повинен бути закінчений за допомогою break.

const n = parseInt(prompt("Введіть число n!"), 10)

if (n !== n || n > 100 || n < 1) {
    console.log("Невірні дані");       
} else {
    for (let i = 1; i <= 100; i += 1) {
    if (i >= n) {
        break
    } 
    console.log(i);
 }
}

// 5.За допомогою циклу while вивести в консоль всі числа від 1 до 20, крім чисел, кратних 3. 
// Якщо зустрінете число, кратне 3, цикл повинен продовжити виконання за допомогою оператора continue.
let d = 1;
while (d <= 20) {
    if (d % 3 === 0) {
        d += 1
        continue
    }
    console.log(d);
    d += 1;  
}
